//
//  AthkarFunction.swift
//  GeneralTools
//
//  Created by Salman Mohammed on 13/06/1442 AH.
//  Copyright © 1442 Salman Mohammed. All rights reserved.
//

import Foundation
import UIKit


class athkarFunction {

    let athkarArray = ["26","اللهم صلِّ وسلم على نبينا محمد.\n\nالله سبحانه وتعالى يقول في كتابه العزيز: إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا (سورة الأحزاب/56)\n\nوقال عليه الصلاة والسلام في الحديث الصحيح: من صلى علي واحدة صلى الله عليه بها عشرًا.","أستغفر الله وأتـوب إليه.\n\nيقولها مائة مرة في اليوم.\n\n(رواه البخاري)\n\nمائة مرة","اللهم انى أسألك علمًا نافعًا ورزقًا طيبًا وعملًا متقبلًا.\n\n(رواه ابن ماجة)","سبحان الله وبحمدهِ عدد خلقهِ ورضى نفسه وزنة عرشه ومداد كلماته.\n\nيقولها ثلاث مرات إذا أصبح.\n\n(رواه مسلم)\n\nثلاث مرات","سُبْحَانَ الله وَبِحَمْدِهِ.\n\nمن قالها مائة مرة حين يصبح وحين يمسي لم يأت احد يوم القيامة بأفضل مما جاء به الا احد قال مثلما قال أوزاد عليه.\n\n(رواه مسلم)\n\nمائة مرة","لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئٍ قدير.\n\nيقولها عشر مرات او مرة واحدة عند الكسل.\n\n(رواه أبو داود).\n\n\nمن قالها مائة مرة في يوم كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكانت له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بافضل مما جاء به إلا احد عمل اكثر من ذلك.\n\n(رواه الترمذي)\n\nعشر مرات أو مائة مرة","أصبحنا على فطرةِ الإسلام، وعلى كلمةِ الإخلاص، وعلى دين نبينا محمدٍ صلى الله عليه وسلم، وعلى ملةِ ابينا إبراهيم حنيفًا مسلمًا وما كان من المشركين.\n\n(رواه أحمد)","أصبحنا وأصبح المُلك لله ربِّ العالمين، اللهم إني أسألك خير هذا اليوم فتحه ونصره ونوره وبركته وهُداه، وأعوذ بك من شرِّ ما فيه و شرِّ ما بعده.\n\n(رواه ابوداود)","يا حي يا قيوم برحمتكَ استغيث، أصلح لي شأنى كُلَه، ولا تَكِلنى إلى نفسي طرفة عين.\n\n(رواه الترمذي)","رضيتُ بالله رَبًّا وبالإسلام دينًا وبمحمدٍ صلى الله عليه وسلم نبيًا.\n\nمن قالها ثلاثًا حين يصبح و ثلاثًا حين يمسي كان حقًا على الله أن يرضيه يوم القيامة.\n\n(رواه أحمد)\n\nثلاث مرات","بسم الله الذي لا يضرُ مع اسمهِ شئٌ في الارضِ ولا في السماء وهو السميع العليم.\n\nمن قالها ثلاثًا إذا أصبح و ثلاثًا إذا أمسي لم يضره شئ.\n\n(رواه ابن ماجة)\n\nثلاث مرات","اللهم عالمَ الغيبِ والشهادة فاطرَ السمواتِ والأرض، ربَّ كل شئ ٍ ومليكه أشهدُ أن لا إله إلا أنت، أعوذ بك من شرِّ نفسي، ومن شرِّ الشيطانِ وشَركِه، وأن أقترفَ على نفسي سوءً، أو أجُـرَهُ إلى مسلم.\n\n(رواه الترمذي)","اللهم إني أسألك العفو والعافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي، وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي وأعوذ بعظمتك أن اُغتالَ من تحتي.\n\n(رواه أبوداود)","حسبي الله لا إله إلا هو عليه توكلتُ وهو ربُّ العرش العظيم.\n\nمن قالها حين يصبح وحين يمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة.\n\n(رواه أبن السني)\n\nسبع مرات","اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدّين وقهر الرجال.\n\n(رواه أبوداود)","اللهمَّ عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري لا إله إلا أنت. اللهم إني أعوذ بك من الكُـفرِ والفقر، وأعوذ بك من عذابِ القبر لا إله إلا أنت.\n\n(رواه أحمد)\n\nثلاث مرات","اللهم ما أصبح بي من نعمة أو بأحدٍ من خلقك فـَمِنكَ وحدك لا شريك لك فلك الحمدُ ولك الشكر.\n\nمن قالها حين يصبح فقد أدى شكر يومه ومن قالها حين يمسي فقد أدى شكر ليلته.\n\n(رواه أبوداود)","اللهم إني أصبحتُ أُشهدكَ وأُشهدُ حملةَ عرشك وملائكتكَ وجميع خلقك أنك أنت الله لا إله إلا أنت وحدك لا شريك لك وأن محمدًا عَبدُكَ ورسولك.\n\nمن قالها حين يصبح أو يمسي أربع مرات أعتقه الله من النار. (رواه أبو داود)\n\nأربع مرات","اللهم أنت ربي لا إله إلا أنت، خلقتنى وأنا عبدك وانا على عهدك ووعدك ما استطعت، أعوذُ بك من شرِ ما صنعت، أبوء لك بنعمتك علي وأبوء بذنبي فاغفر لي، فإنه لا يغفرُ الذنوب إلا أنت.\n\nمن قالها موقن بها حين يصبح فمات من يومه دخل الجنة، ومن قالها موقن بها حين يمسي فمات من ليلته دخل الجنة.\n\n(رواه البخاري)","اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور. \n\n(رواه الترمذي)","أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملكُ وله الحمدُ وهو على كل شئ ٍ قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شرِّ ما في هذا اليوم وشرِّ ما بعده، ربِّ أعوذُ بك من الكسل وسُوء الكِـبَـر، ربِّ أعوذ بك من عذابٍ في النارِ وعذابٍ فيالقبر.\n\n(رواه مسلم)","بسم الله الرحمن الرحيم\n\nقُلۡ أَعُوذُ بِرَبِّ ٱلنَّاسِ (١) مَلِكِ ٱلنَّاسِ (٢) إِلَـٰهِ ٱلنَّاسِ (٣) مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ (٤) ٱلَّذِى يُوَسۡوِسُ فِى صُدُورِ ٱلنَّاسِ (٥) مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ (٦)\n\n(الناس / 1 – 6)\n\nثلاث مرات","بسم الله الرحمن الرحيم\n\nقُلۡ أَعُوذُ بِرَبِّ ٱلۡفَلَقِ (١) مِن شَرِّ مَا خَلَقَ ٢ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ (٣) وَمِن شَرِّ ٱلنَّفَّـٰثَـٰتِ فِى ٱلۡعُقَدِ (٤) وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ (٥)\n\n(الفلق / 1 – 5)\n\nثلاث مرات","بسم الله الرحمن الرحيم\n\nقُلۡ هُوَ ٱللَّهُ أَحَدٌ (١) ٱللَّهُ ٱلصَّمَدُ ٢ لَمۡ يَلِدۡ وَلَمۡ يُولَدۡ (٣) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (٤)\n\n(الإخلاص / 1 – 4)\n\nثلاث مرات","أعوذ بالله من الشيطان الرجيم\n\n اللَّهُ لا إِلٰهَ إِلّا هُوَ الحَىُّ القَيّومُ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ لَهُ ما فِى السَّمٰوٰتِ وَما فِى الأَرضِ مَن ذَا الَّذى يَشفَعُ عِندَهُ إِلّا بِإِذنِهِ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلّا بِما شاءَ وَسِعَ كُرسِيُّهُ السَّمٰوٰتِ وَالأَرضَ وَلا يَـٔودُهُ حِفظُهُما وَهُوَ العَلِىُّ العَظيمُ (٢٥٥)\n\n من قالها حين يصبح أجير من الجن حتى يمسي ومن قالها حين يمسي أجير منهم حتى يصبح. \n\n(رواه الحاكم)(البقرة / 255)"]
    var counter = 1
    var athkarText = ""

     
    func athkarFunctionNext() {
       

        if counter < athkarArray.count-1 {
          
            counter += 1
            athkarText = athkarArray[athkarArray.count - counter ]
//            print(counter)
//            print(athkarText)
        }
    }


func athkarFunctionPrev() {
  

    if counter > athkarArray.count - 25 {
            counter -= 1
             athkarText = athkarArray[athkarArray.count - counter ]
//              print(counter)
//              print(athkarText)
              
          }
}


}
